cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3L1x8_SVD.xml
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TS7MUX</name>
							<description>Time Slot 7 Input Channel. </description>
							<bitOffset>26</bitOffset>
							<bitWidth>5</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ADCN0</name>
									<description>Select channel &lt;dict&gt;ADCn.0&lt;/dict&gt;.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN1</name>
									<description>Select channel &lt;dict&gt;ADCn.1&lt;/dict&gt;.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN2</name>
									<description>Select channel &lt;dict&gt;ADCn.2&lt;/dict&gt;.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN3</name>
									<description>Select channel &lt;dict&gt;ADCn.3&lt;/dict&gt;.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN4</name>
									<description>Select channel &lt;dict&gt;ADCn.4&lt;/dict&gt;.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN5</name>
									<description>Select channel &lt;dict&gt;ADCn.5&lt;/dict&gt;.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN6</name>
									<description>Select channel &lt;dict&gt;ADCn.6&lt;/dict&gt;.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN7</name>
									<description>Select channel &lt;dict&gt;ADCn.7&lt;/dict&gt;.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN8</name>
									<description>Select channel &lt;dict&gt;ADCn.8&lt;/dict&gt;.</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN9</name>
									<description>Select channel &lt;dict&gt;ADCn.9&lt;/dict&gt;.</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN10</name>
									<description>Select channel &lt;dict&gt;ADCn.10&lt;/dict&gt;.</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN11</name>
									<description>Select channel &lt;dict&gt;ADCn.11&lt;/dict&gt;.</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN12</name>
									<description>Select channel &lt;dict&gt;ADCn.12&lt;/dict&gt;.</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN13</name>
									<description>Select channel &lt;dict&gt;ADCn.13&lt;/dict&gt;.</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN14</name>
									<description>Select channel &lt;dict&gt;ADCn.14&lt;/dict&gt;.</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN15</name>
									<description>Select channel &lt;dict&gt;ADCn.15&lt;/dict&gt;.</description>
									<value>15</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN16</name>
									<description>Select channel &lt;dict&gt;ADCn.16&lt;/dict&gt;.</description>
									<value>16</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN17</name>
									<description>Select channel &lt;dict&gt;ADCn.17&lt;/dict&gt;.</description>
									<value>17</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN18</name>
									<description>Select channel &lt;dict&gt;ADCn.18&lt;/dict&gt;.</description>
									<value>18</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN19</name>
									<description>Select channel &lt;dict&gt;ADCn.19&lt;/dict&gt;.</description>
									<value>19</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN20</name>
									<description>Select channel &lt;dict&gt;ADCn.20&lt;/dict&gt;.</description>
									<value>20</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN21</name>
									<description>Select channel &lt;dict&gt;ADCn.21&lt;/dict&gt;.</description>
									<value>21</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN22</name>
									<description>Select channel &lt;dict&gt;ADCn.22&lt;/dict&gt;.</description>
									<value>22</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN23</name>
									<description>Select channel &lt;dict&gt;ADCn.23&lt;/dict&gt;.</description>
									<value>23</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN24</name>
									<description>Select channel &lt;dict&gt;ADCn.24&lt;/dict&gt;.</description>
									<value>24</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN25</name>
									<description>Select channel &lt;dict&gt;ADCn.25&lt;/dict&gt;.</description>
									<value>25</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN26</name>
									<description>Select channel &lt;dict&gt;ADCn.26&lt;/dict&gt;.</description>
									<value>26</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN27</name>
									<description>Select channel &lt;dict&gt;ADCn.27&lt;/dict&gt;.</description>
									<value>27</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN28</name>
									<description>Select channel &lt;dict&gt;ADCn.28&lt;/dict&gt;.</description>
									<value>28</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN29</name>
									<description>Select channel &lt;dict&gt;ADCn.29&lt;/dict&gt;.</description>
									<value>29</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN30</name>
									<description>Select channel &lt;dict&gt;ADCn.30&lt;/dict&gt;.</description>
									<value>30</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>END</name>
									<description>None - End the sequence.</description>
									<value>31</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
