cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3L1x8_SVD.xml
				<register>
					<name>CONFIG</name>
					<description>Module Configuration</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SCALER</name>
							<description>I2C Clock Scaler. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>STOIEN</name>
							<description>Stop Interrupt Enable. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the stop interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the stop interrupt (STOI).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ACKIEN</name>
							<description>Acknowledge Interrupt Enable. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the acknowledge interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the acknowledge interrupt (ACKI).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXIEN</name>
							<description>Receive Done Interrupt Enable. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the receive done interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the receive done interrupt (RXI).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXIEN</name>
							<description>Transmit Done Interrupt Enable. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the transmit done interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the transmit done interrupt (TXI).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STAIEN</name>
							<description>Start Interrupt Enable. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the start interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the start interrupt (STAI).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ARBLIEN</name>
							<description>Arbitration Lost Interrupt Enable. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the arbitration lost interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the arbitration lost interrupt (ARBLI).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T0IEN</name>
							<description>I2C Timer Byte 0 Interrupt Enable. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the I2C Timer Byte 0 interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the I2C Timer Byte 0 interrupt (T0I).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T1IEN</name>
							<description>I2C Timer Byte 1 Interrupt Enable. </description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the I2C Timer Byte 1 interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the I2C Timer Byte 1 interrupt (T1I).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2IEN</name>
							<description>I2C Timer Byte 2 Interrupt Enable. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the I2C Timer Byte 2 interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the I2C Timer Byte 2 interrupt (T2I).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T3IEN</name>
							<description>I2C Timer Byte 3 Interrupt Enable. </description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the I2C Timer Byte 3 and SCL low timeout interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the I2C Timer Byte 3 and SCL low timeout interrupt (T3I).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BC</name>
							<description>Transfer Byte Count. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>BP</name>
							<description>Transfer Byte Pointer. </description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>T0RUN</name>
							<description>I2C Timer Byte 0 Run. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>STOP</name>
									<description>Stop Timer Byte 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START</name>
									<description>Start Timer Byte 0 running.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T1RUN</name>
							<description>I2C Timer Byte 1 Run. </description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>STOP</name>
									<description>Stop Timer Byte 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START</name>
									<description>Start Timer Byte 1 running.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2RUN</name>
							<description>I2C Timer Byte 2 Run. </description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>STOP</name>
									<description>Stop Timer Byte 2.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START</name>
									<description>Start Timer Byte 2 running.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T3RUN</name>
							<description>I2C Timer Byte 3 Run. </description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>STOP</name>
									<description>Stop Timer Byte 3.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START</name>
									<description>Start Timer Byte 3 running.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMD</name>
							<description>I2C Timer Mode. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>MODE0</name>
									<description>I2C Timer Mode 0: Operate the I2C timer as a single 32-bit timer : Timer Bytes [3 : 2 : 1 : 0].</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE1</name>
									<description>I2C Timer Mode 1: Operate the I2C timer as two 16-bit timers : Timer Bytes [3 : 2] and Timer Bytes [1 : 0].</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE2</name>
									<description>I2C Timer Mode 2: Operate the I2C timer as four independent 8-bit timers :  Timer Byte 3, Timer Byte 2, Timer Byte 1, and Timer Byte 0.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE3</name>
									<description>I2C Timer Mode 3: Operate the I2C timer as one 16-bit and two 8-bit timers : Timer Bytes [3 : 2], Timer Byte 1, and Timer Byte 0.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIMEREN</name>
							<description>I2C Timer Enable. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable I2C Timer.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable I2C Timer for general purpose use. This setting should not be used when the I2C module is enabled (I2CEN = 1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SADDRESS</name>
					<description>Slave Address</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADDRESS</name>
							<description>Slave Address. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SMASK</name>
					<description>Slave Address Mask</description>
					<addressOffset>0x30</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MASK</name>
							<description>Slave Address Mask. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA</name>
					<description>Data Buffer Access</description>
					<addressOffset>0x40</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description>Data. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMER</name>
					<description>Timer Data</description>
					<addressOffset>0x50</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>T0</name>
							<description>Timer Byte 0. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>T1</name>
							<description>Timer Byte 1. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>T2</name>
							<description>Timer Byte 2. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>T3</name>
							<description>Timer Byte 3. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMERRL</name>
					<description>Timer Reload Values</description>
					<addressOffset>0x60</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>T0RL</name>
							<description>Timer Byte 0 Reload Value. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>T1RL</name>
							<description>Timer Byte 1 Reload Value. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>T2RL</name>
							<description>Timer Byte 2 Reload Value. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>T3RL</name>
							<description>Timer Byte 3 Reload Value. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SCONFIG</name>
					<description>SCL Signal Configuration</description>
					<addressOffset>0x70</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETUP</name>
							<description>Data Setup Time Extension. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>HOLD</name>
							<description>Data Hold Time Extension. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SCLL</name>
							<description>SCL Low Time Extension. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>SCLLTIMER</name>
							<description>SCL Low Timer Bits [3:0]. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I2CDMA</name>
					<description>DMA Configuration</description>
					<addressOffset>0x80</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DMALEN</name>
							<description>DMA Transfer Length. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>DMAEN</name>
							<description>DMA Mode Enable. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable I2C DMA data requests.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable I2C DMA data requests.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
