cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3L1x8_SVD.xml
			</registers>
		</peripheral>
		<peripheral>
			<name>LCD_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>LCD_0</groupName>
			<baseAddress>0x4004d000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONFIG</name>
					<description>Configuration</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LCDEN</name>
							<description>Module Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the LCD module.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the LCD module.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CPFPDEN</name>
							<description>Charge Pump Full Power Drive Mode Enable. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the LCD charge pump's full power drive mode. The charge pump draws less power but operates with reduced output current capabilities.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the LCD charge pump's full output drive mode. The charge pump operates at full power.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCDEN</name>
							<description>LCD Missing Clock Detector Enable. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the dedicated LCD missing clock detector.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the dedicated LCD missing clock detector.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RTCCEN</name>
							<description>RTC Clock Request Enable. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The LCD module does not require the RTC clock.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The LCD module requires an active and valid RTC clock (RTC0TCLK).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BIASEN</name>
							<description>Bias Enable. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the LCD bias current.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the LCD bias current.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DCDCBIASEN</name>
							<description>DCDC Bias Output Enable. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the secondary bias current output.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the secondary bias current output.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DCDCSTDBYEN</name>
							<description>DCDC Bias Standy Enable. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The DCDC bias is enabled in Power Mode 8.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The DCDC bias is disabled in Power Mode 8.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CPBEN</name>
							<description>Charge Pump Bypass Enable. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The LCD charge pump generates the VLCD voltage.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Bypass the LCD charge pump and connect VLCD directly to VBAT.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HCVLPMEN</name>
							<description>High Contrast Voltage Low-Power Mode Enable. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the high contrast voltage low-power mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the high contrast voltage low-power mode. This mode reduces power consumption whenVLCD is higher than VBAT.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VBMLPEN</name>
							<description>VBAT Monitor Low Power Enable. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the LCD VBAT Monitor low power mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the LCD VBAT Monitor low power mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CPOLPEN</name>
							<description>Charge Pump Oscillator Low Power Enable. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the charge pump oscillator low power mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the charge pump oscillator low power mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPBLPEN</name>
							<description>Comparator Buffer Low Power Enable. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the comparator buffer low power mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the comparator buffer low power mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BIASSEN</name>
							<description>Bias Switching Enable. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable bias switching.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable bias switching.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RBGSEN</name>
							<description>Reference Bandgap Switching Enable. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable reference bandgap switching mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Disable reference bandgap switching mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CPACEN</name>
							<description>Charge Pump Auto-Contrast Enable. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>VLCD continues to track VBAT when VBAT drops below the programmed VLCD value.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The module automatically enables the charge pump and maintains the VLCD voltage when VBAT drops below the programmed VBAT monitor level.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FBIASCEN</name>
							<description>Force Bias Continuous Mode Enable. </description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The bias operates as configured.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Force the bias to operate in continuous mode. The bias will cleanly transition from its configuration settings to continuous mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BIASBGR</name>
							<description>Bias to Bandgap Switching Cycle Ratio. </description>
							<bitOffset>18</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>HCVCBYPEN</name>
							<description>High Contrast Voltage Comparator Bypass Enable. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Hardware enables the high contrast voltage comparator as needed.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>High contrast voltage comparator in bypass mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HCVCFOEN</name>
							<description>High Contrast Voltage Comparator Force On Enable. </description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Hardware enables the high contrast voltage comparator as needed.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>High contrast voltage comparator force on enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HCVCHMD</name>
							<description>High Contrast Voltage Comparator Hysteresis. </description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set the high contrast voltage comparator to low hysteresis mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set the high contrast voltage comparator to high hysteresis mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HCVCBMD</name>
							<description>High Contrast Voltage Comparator Bias. </description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set the high contrast voltage comparator to low bias mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set the high contrast voltage comparator to high bias mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CPSMD</name>
							<description>Charge Pump Supply Mode. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>EXTERNAL</name>
									<description>Select the external supply for the charge pump.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VLCD</name>
									<description>Select VLCD as the supply for the charge pump.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CLKCONTROL</name>
					<description>Clock Control</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x04A07C00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLKDIV</name>
							<description>Clock Divider. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>10</bitWidth>
						</field>
						<field>
							<name>RTCCLKDIV</name>
							<description>RTC Input Clock Divider. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIVIDE_BY_1</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIVIDE_BY_2</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIVIDE_BY_4</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIVIDE_BY_8</name>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BLKCONTROL</name>
					<description>Blinking Control</description>
					<addressOffset>0x30</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BLKMASK</name>
							<description>Hardware Blinking Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>BLKREXP</name>
							<description>Hardware Blinking Rate Divider Exponent. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIVIDE_BY_2</name>
									<description>Set blink rate divider to divide by 2.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIVIDE_BY_4</name>
									<description>Set blink rate divider to divide by 4.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIVIDE_BY_8</name>
									<description>Set blink rate divider to divide by 8.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIVIDE_BY_16</name>
									<description>Set blink rate divider to divide by 16.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIVIDE_BY_32</name>
									<description>Set blink rate divider to divide by 32.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIVIDE_BY_64</name>
									<description>Set blink rate divider to divide by 64.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIVIDE_BY_128</name>
									<description>Set blink rate divider to divide by 128.</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIVIDE_BY_256</name>
									<description>Set blink rate divider to divide by 256.</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIVIDE_BY_512</name>
									<description>Set blink rate divider to divide by 512.</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIVIDE_BY_1024</name>
									<description>Set blink rate divider to divide by 1024.</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIVIDE_BY_2048</name>
									<description>Set blink rate divider to divide by 2048.</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIVIDE_BY_4096</name>
									<description>Set blink rate divider to divide by 4096.</description>
									<value>13</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SEGCONTROL</name>
					<description>Segment Control</description>
					<addressOffset>0x40</addressOffset>
					<resetValue>0x00000080</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BIASMD</name>
							<description>Hardware Bias Mode. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ONE_THIRD</name>
									<description>Select 1/3 bias.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONE_HALF</name>
									<description>Select 1/2 bias.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEGMD</name>
							<description>Segment Mode. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>STATIC</name>
									<description>Select static segment mode with one common COMn.0 used.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_MUX</name>
									<description>Select two-mux segment mode with two commons (COMn.0 and COMn.1) used.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3_MUX</name>
									<description>Select three-mux segment mode with three commons (COMn.0, COMn.1, COMn.2) used.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_MUX</name>
									<description>Select four-mux segment mode with four commons (COMn.0, COMn.1, COMn.2 and COMn.3) used.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BLANKEN</name>
							<description>Segment Blank Enable. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Operate segments normally.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Ground the segment pins regardless of the current LCD control state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RPHEN</name>
							<description>Reset Phase Enable. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Hardware switches the LCD segment and common pin controls directly from one state to another.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Hardware switches the LCD segment and common pin controls to intermediate states for several RTC clock cycles before switching to the next state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RPHMD</name>
							<description>Reset Phase Mode. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
