cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3L1x8_SVD.xml
				<register>
					<name>CTRSTCONTROL</name>
					<description>Contrast Control</description>
					<addressOffset>0x60</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CTRST</name>
							<description>Contrast Voltage. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>CTRSTBF</name>
							<description>Contrast Busy Flag. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>An update of the internal contrast registers is not in progress.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>The internal contrast registers are busy updating.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CPCDEN</name>
							<description>Charge Pump Capacitor Divider Enable. </description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the charge pump capacitor divider.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the charge pump capacitor divider.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>VBMCONTROL</name>
					<description>VBAT Monitor Control</description>
					<addressOffset>0x70</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VBMTH</name>
							<description>VBAT Monitor Threshold. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>VBMBF</name>
							<description>VBAT Monitor Busy Flag. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>An update of the internal VBAT monitor registers is not in progress.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>The internal VBAT monitor registers are busy updating.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VBMCLKDIV</name>
							<description>VBAT Monitor Clock Divider. </description>
							<bitOffset>22</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>VBMCDEN</name>
							<description>VBAT Monitor Capacitor Divider Enable. </description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the VBAT monitor capacitor divider.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the VBAT monitor capacitor divider.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VBMOEN</name>
							<description>VBAT Monitor Offset Enable. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The VBAT monitor threshold set by the VBMTH field functions as an absolute threshold value for the VBAT monitor.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The VBAT monitor threshold set by the VBMTH field functions as an offset to the LCD contrast value set by CTRSTMD.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VBMEN</name>
							<description>VBAT Monitor Enable. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the VBAT monitor.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the VBAT monitor.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SEGMASK0</name>
					<description>Segment Mask 0</description>
					<addressOffset>0x80</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEGEN</name>
							<description>Segment Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SEGMASK1</name>
					<description>Segment Mask 1</description>
					<addressOffset>0x90</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEGEN</name>
							<description>Segment Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SEGDATA0</name>
					<description>Segment Data 0</description>
					<addressOffset>0xa0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEGDATA0</name>
							<description>Segment LCDn.0 Control. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SEGDATA1</name>
					<description>Segment Data 1</description>
					<addressOffset>0xb0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEGDATA1</name>
							<description>Segment LCDn.8 Control. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SEGDATA2</name>
					<description>Segment Data 2</description>
					<addressOffset>0xc0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEGDATA2</name>
							<description>Segment LCDn.16 Control. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SEGDATA3</name>
					<description>Segment Data 3</description>
					<addressOffset>0xd0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEGDATA3</name>
							<description>Segment LCDn.24 Control. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SEGDATA4</name>
					<description>Segment Data 4</description>
					<addressOffset>0xe0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEGDATA4</name>
							<description>Segment LCDn.32 Control. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
